2. Basic Dataframe Understanding

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "Name": ['Abdullah','Akansha','Farhan','Ayesha'],
    "Age": [20,23,18,21],
    "salary": [90000,70000,75000,45000]
    
}
df = pd.DataFrame(data)
print(df)

       Name  Age  salary
0  Abdullah   20   90000
1   Akansha   23   70000
2    Farhan   18   75000
3    Ayesha   21   45000

In [ ]:
df.head(2) #top rows

       Name  Age  salary
0  Abdullah   20   90000
1   Akansha   23   70000

In [4]:
df.tail(2)

     Name  Age  salary
2  Farhan   18   75000
3  Ayesha   21   45000

In [ ]:
df.shape # returning tha tuple containing the shape of the dataframe-- rows and column

(4, 3)

In [6]:
df

       Name  Age  salary
0  Abdullah   20   90000
1   Akansha   23   70000
2    Farhan   18   75000
3    Ayesha   21   45000

In [ ]:
df.info() #info method prints information about the DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [ ]:
df.describe() # describe method generates descriptive statistics of DataFrame, only for numerical-value columns

             Age        salary
count   4.000000      4.000000
mean   20.500000  70000.000000
std     2.081666  18708.286934
min    18.000000  45000.000000
25%    19.500000  63750.000000
50%    20.500000  72500.000000
75%    21.500000  78750.000000
max    23.000000  90000.000000

In [ ]:
df.columns # column names

Index(['Name', 'Age', 'salary'], dtype='object')

In [ ]:
df.index #row label

RangeIndex(start=0, stop=4, step=1)